internal/cli/testdata/golden/nomnom-ts/topology.mmd
%% Architecture of nomnom-ts, generated by cloudcc.
flowchart LR
    execution_unit_dispatch["dispatch\nexecution_unit"]
    execution_unit_inventory["inventory\nexecution_unit"]
    execution_unit_menu["menu\nexecution_unit"]
    execution_unit_notify["notify\nexecution_unit"]
    execution_unit_pricing["pricing\nexecution_unit"]
    execution_unit_storefront["storefront\nexecution_unit"]
    execution_unit_tracking["tracking\nexecution_unit"]
    expose_nomnom_api(["nomnom-api\nexpose"])
    expose_nomnom_menu(["nomnom-menu\nexpose"])
    persist_fs_notifications[("notifications\npersist_fs")]
    persist_kv_assignments[("assignments\npersist_kv")]
    persist_kv_menuPrices[("menuPrices\npersist_kv")]
    persist_kv_orders[("orders\npersist_kv")]
    persist_kv_reservations[("reservations\npersist_kv")]
    persist_kv_trackingEvents[("trackingEvents\npersist_kv")]
    pubsub_courierAssigned>"courierAssigned\npubsub"]
    pubsub_orderPlaced>"orderPlaced\npubsub"]
    execution_unit_dispatch ==>|calls| execution_unit_inventory
    execution_unit_storefront ==>|calls| execution_unit_inventory
    execution_unit_storefront ==>|calls| execution_unit_pricing
    execution_unit_storefront ==>|calls| execution_unit_tracking
    expose_nomnom_api -->|exposes| execution_unit_storefront
    expose_nomnom_menu -->|exposes| execution_unit_menu
    execution_unit_dispatch -->|publishes| pubsub_courierAssigned
    execution_unit_storefront -->|publishes| pubsub_orderPlaced
    execution_unit_dispatch -.->|subscribes| pubsub_orderPlaced
    execution_unit_notify -.->|subscribes| pubsub_courierAssigned
    execution_unit_notify -.->|subscribes| pubsub_orderPlaced
    execution_unit_tracking -.->|subscribes| pubsub_courierAssigned
    execution_unit_dispatch -->|uses| execution_unit_inventory
    execution_unit_dispatch -->|uses| persist_kv_assignments
    execution_unit_dispatch -->|uses| pubsub_courierAssigned
    execution_unit_dispatch -->|uses| pubsub_orderPlaced
    execution_unit_inventory -->|uses| persist_kv_reservations
    execution_unit_notify -->|uses| persist_fs_notifications
    execution_unit_notify -->|uses| pubsub_courierAssigned
    execution_unit_notify -->|uses| pubsub_orderPlaced
    execution_unit_pricing -->|uses| persist_kv_menuPrices
    execution_unit_storefront -->|uses| execution_unit_inventory
    execution_unit_storefront -->|uses| execution_unit_pricing
    execution_unit_storefront -->|uses| execution_unit_tracking
    execution_unit_storefront -->|uses| persist_kv_orders
    execution_unit_storefront -->|uses| pubsub_courierAssigned
    execution_unit_storefront -->|uses| pubsub_orderPlaced
    execution_unit_tracking -->|uses| persist_kv_trackingEvents
    execution_unit_tracking -->|uses| pubsub_courierAssigned
    execution_unit_tracking -->|uses| pubsub_orderPlaced
